In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
ser = Series(np.random.randn(6), index=[[1,1,1,2,2,2,],['a','b','c','a','b','c']])

In [4]:
ser

1  a   -0.589252
   b    0.554467
   c   -0.483304
2  a    0.710107
   b   -0.817367
   c    0.198214
dtype: float64

In [5]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [6]:
ser[1]

a   -0.589252
b    0.554467
c   -0.483304
dtype: float64

In [7]:
ser[2]

a    0.710107
b   -0.817367
c    0.198214
dtype: float64

In [8]:
ser[:,'a']

1   -0.589252
2    0.710107
dtype: float64

In [9]:
dframe = ser.unstack()

In [10]:
dframe

          a         b         c
1 -0.589252  0.554467 -0.483304
2  0.710107 -0.817367  0.198214

In [11]:
dframe.unstack()

a  1   -0.589252
   2    0.710107
b  1    0.554467
   2   -0.817367
c  1   -0.483304
   2    0.198214
dtype: float64

In [12]:
dframe.T.unstack()

1  a   -0.589252
   b    0.554467
   c   -0.483304
2  a    0.710107
   b   -0.817367
   c    0.198214
dtype: float64

In [15]:
dframe2 = DataFrame(np.arange(16).reshape((4,4)),
                   index=[['a','a','b','b'],[1,2,1,2,]],
                   columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])

In [17]:
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [18]:
dframe2.index.names = ['INDEX_1','INDEX_2']

In [20]:
dframe2

                  NY      LA   SF
                cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [21]:
dframe2.columns.names  = ['Cities','Temp']

In [23]:
dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [24]:
dframe2.swaplevel('Cities', 'Temp', axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [31]:
# dframe2.sortlevel(1) これだとWarningが出る。将来使えない?
dframe2.sort_index(level=1)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [32]:
dframe2.sort_index(level=0)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [33]:
dframe2.sum(level='Temp', axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27